[
  {
    "id": "collab",
    "title": "Projet collaboratif",
    "subtitles": [
      {
        "id": "collab-os",
        "icon": "bi bi-people-fill",
        "title": "ADE Scheduler est open source",
        "content": "Un aspect très important de ce projet est qu'il est open source. Pour faire court, cela veut dire que tout le monde peut avoir un accès total au code et le réutiliser. Mais cela veut aussi dire que vous pouvez faire des demandes pour que l'outil soit amélioré. <br><br> Pour le moment, ADE Scheduler est supporté par quelques membres académiques de l'UCLouvain ce qui nous évite de devoir payer pour les frais liés au serveur et nous leur en sommes reconnaissants pour cela ! "
      },
      {
        "id": "collabd-help-us",
        "title": "Vous pouvez nous aider !",
        "content": "Même si l'outil est fonctionnel, il n'est pas parfait. Des nouvelles fonctionnalités, des typos dans du texte ou des bugs ? Il y a plein de choses que vous pouvez nous aider à améliorer. <br><br> Ci-dessous, nous proposons plusieurs façons de nous aider. Cependant, toute autre idée est la bienvenue !"
      }
    ]
  },
  {
    "id": "non-prog",
    "title": "Pour les non-programmeurs",
    "content": "Pour tout ce qui est listé plus bas, la meilleure manière pour nous contacter est de le faire via mail. Notre adresse se trouve sur la page de contact. Quand vous nous contactez, n'hésitez pas à inclure des captures d'écran ou même un lien de partage vers votre calendrier comme ça on peut aisément reproduire votre problème (si ça s'applique) localement. ",
    "subtitles": [
      {
        "id": "non-progs-bugs",
        "icon": "bi bi-bug-fill",
        "title": "Signaler un bug",
        "content": "Les évènements ne correspondent pas à ceux que vous avez encodés ? Des locaux sont manquants ou sont mal localisés sur la carte ? Une fonctionnalité ne marche pas comme vous le pensiez ? <br><br> Peut-être que le problème est dû à une erreur dans notre code, ou peut-être est-ce dû à une faute dans l'encodage des cours de la part des personnes en charge des données de ADE. Quoi qu'il en soit, contactez-nous et nous ferons tout notre possible pour régler votre problème. "
      },
      {
        "id": "non-progs-typo",
        "icon": "bi bi-spellcheck",
        "title": " Corriger des typos ",
        "content": " Écrire des milliers de lignes de texte en anglais et en français devient rapidement sujet aux erreurs et cela devient difficile de toutes les trouver! <br><br> S'il vous arrivait d'en trouver, contactez-nous comme ça on peut les corriger. Cela s'applique aussi si vous pensez qu'une formulation n'est pas correcte ou pourrait être améliorée. "
      },
      {
        "id": "non-prog-request",
        "icon": "bi bi-plus-circle-fill",
        "title": "Proposer de nouvelles fonctionnalités ",
        "content": " ADE Scheduler évolue constamment, avec l'objectif de satisfaire les besoins des membres de l'UCLouvain en termes d'outils de planification d'horaires. De ce fait, toute idée est la bienvenue ! N'hésitez pas à nous contacter en décrivant la nouvelle fonctionnalité que vous souhaiteriez voir, en ajoutant éventuellement des images si vous avez une idée claire en tête. "
      }
    ]
  },
  {
    "id": "prog",
    "title": "Pour les programmeurs",
    "subtitles": [
      {
        "id": "progs-contribute",
        "icon": "bi bi-github",
        "title": "Contribuer via GitHub",
        "content": "Notre code est disponible pour tous sur <a href='https://github.com/SnaKyEyeS/ADE-Scheduler'>GitHub</a> et nous recommandons fortement aux programmeurs d'utiliser l'outil git quand ils travaillent sur leurs projets. Si cet outil est nouveau pour vous, n'hésitez jamais à nous poser des questions ! <br><br> Tout ce qui a été dit pour les non-programmeurs s'applique aussi pour les programmeurs. À la place d'utiliser des mails, utilisez les <a href='https://github.com/SnaKyEyeS/ADE-Scheduler/issues'>issues</a> GitHub quand vous voulez rapporter un problème ou faire une demande de nouvelle fonctionnalité, et les <a href='https://github.com/SnaKyEyeS/ADE-Scheduler/pulls'>pull requests</a> quand vous voulez qu'on vérifie votre code pour éventuellement l'inclure dans l'outil. Si vous voulez contribuer, mais que vous n'avez pas une idée spécifique en tête, c'est toujours une bonne idée d'aller lire les issues que d'autres personnes ont écrites afin de voir si vous pouvez aider. <br><br> Même si vous ne comptez pas contribuer au code, nous recommandons fortement aux personnes qui connaissent git ou GitHub de nous contacter via notre répertoire GitHub, cela nous permet de centraliser les questions et de garder un historique de ces dernières. <br><br> Dernière chose, mais pas des moindres, nous avons écrit une documentation complète disponible <a href='https://ade-scheduler.readthedocs.io/en/latest/'>ici</a> pour vous aider à comprendre notre code afin d'y contribuer. "
      },
      {
        "id": "progs-ects",
        "icon": "bi bi-bookmark-check-fill",
        "title": "Valider des crédits à l'UCLouvain tout en contribuant",
        "content": "À notre connaissance, il y a 2 cours à l'EPL qui offrent des crédits si vous contribuez à un projet open source. Vous pouvez donc contribuer à ADE Scheduler et, en même temps, valider des crédits pour vos études ! <br><br> Le premier, <a href='https://uclouvain.be/cours-2021-linfo2401'>LINFO2401 \"Open Source strategy for software development\"</a>, est donné pendant le Q1 et demande de votre part de faire une contribution très petite. Nous le recommandons fortement comme étant une bonne introduction à l'open source et il vaut 5 crédits. <br><br> Le second, <a href='https://uclouvain.be/cours-2021-linfo2402'>LINFO2402 \"Open Source Project\"</a>, peut être pris, au choix, au Q1 ou au Q2 et demande une contribution pour un total de 140h de travail. Ce dernier peut compter comme un stage et vaut 5 crédits. <br><br> Dans le cas où vous ne pouvez pas, ou ne voulez pas, suivre ces cours, contribuer à un projet open source reste une plus-value très intéressante pour votre CV. Même si c'est une très petite contribution, comme une correction de typo, vous en apprendrez beaucoup ! "
      }
    ]
  },
  {
    "id": "credits",
    "title": "Crédits",
    "subtitles": [
      {
        "id": "credits-creators",
        "title": "Créateurs du projet",
        "content": "ADE Scheduler a été créé pendant l'été 2019 par 3 étudiants de l'EPL : Jérome Eertmans, Louis Navarre et Gilles Poncelet. À l'époque, ils finissaient tout juste leur bachelier en ingénieur civil. Depuis, ils ont été les principaux mainteneurs du projet et continuent d'améliorer l'outil jour après jour."
      },
      {
        "id": "credits-uclouvain",
        "title": "<img class='txt-img' src='/static/img/logo_UCL.png'></img>",
        "content": "Très rapidement, le projet a reçu le soutien de certains membres académiques de l'UCLouvain. Grâce à eux, le projet a pu être hébergé sur les serveurs de l'UCLouvain et a eu accès à l'API officielle d'ADE. Nous aimerions remercier en particulier: <ul class='mt-2'> <li>Pr Yves Deville, pour son soutien de longue date sur plusieurs aspects clés: hébergement serveur, accès API, développement open source et bien plus. </li><li>M. Francis Somers, pour son aide concernant l'utilisation de l'API d'ADE </li><li>M. Anthony Gego, pour son aide à mettre en place et à maintenir l'ancien serveur au pôle INGI.</li><li>M. Rémi Rossi, pour son aide à la mise en place et à la maintenance du nouveau serveur SGSI.</li><li>Et tous les autres membres académiques qui ont fait la promotion de notre outil !</ul>"
      },
      {
        "id": "credits-contributors",
        "icon": "bi bi-star-fill",
        "title": "Contributeurs",
        "content": "Ce projet étant libre d'accès, nous aimerions également remercier tous les gens qui nous ont aidés sur ce projet, tant pour signaler un bug ou pour partager l'outil avec des amis : chaque contribution est extrêmement importante pour nous. Si jamais l'envie vous prend de nous aider sur ce projet, n'hésitez pas à nous contacter !"
      },
      {
        "id": "credits-open-week-2022",
        "title": "<small>Open Week 2022</small>",
        "content": "L'Open Week est un évènement annuel à L'UCLouvain durant lequel des étudiants apprennent à travailler sur des projets open source. Pour l'édition 2022 de l'Open Week, l'un des projet proposés aux étudiants était ADE-Scheduler. Trois étudiants ont travaillé sur l'intégration de calendriers externes (<a href=\"https://github.com/ADE-Scheduler/ADE-Scheduler/pull/850\">#850</a>) : <ul class='mt-2'> <li>Corentin Libert (<a href=\"https://github.com/CorentinLibert\"><code class=\"notranslate\">CorentinLibert</code></a>),</li><li>Paul-Edouard Bertrand Van ouytsel (<a href=\"https://github.com/PaulEdouardBertrandVO\"><code class=\"notranslate\">PaulEdouardBertrandVO</code></a>),</li><li>Simon Cornelis (<a href=\"https://github.com/Simcornelis\"><code class=\"notranslate\">Simcornelis</code></a>).</ul>Un tout grand merci à eux !"
      }
    ]
  }
]
