[
  {
    "id": "collab",
    "title": "Collaborative project",
    "subtitles": [
      {
        "id": "collab-os",
        "icon": "bi bi-people-fill",
        "title": "ADE Scheduler is open source",
        "content": "One very important aspect of this project is that it is open source. In short, it means that everybody can access the whole code behind the tool and re-use it. But it also means that you can request changes so that the tool can be further improved. <br><br> Currently, ADE Scheduler is kindly supported by some academical members at UCLouvain so that we do not have to pay for server hosting fees and we are thankful for that!"
      },
      {
        "id": "collabd-help-us",
        "title": "You can help us!",
        "content": "Even though this tool is functional, it is not perfect. New features, typos in text, missing translations or bugs? There are many things that you can help us improve. <br><br> Down below, we propose multiple ways for you to help us. Nonetheless, any other ideas are welcome!"
      }
    ]
  },
  {
    "id": "non-prog",
    "title": "For non-programmers",
    "content": "For everything listed below, the best way to contact us is to do it via our email address. This can be found in the contact page. When reaching us, do not hesitate to include screenshots or even your calendar share link so that we can easily reproduce your problem (if applies) locally. ",
    "subtitles": [
      {
        "id": "non-progs-bugs",
        "icon": "bi bi-bug-fill",
        "title": "Signal bugs",
        "content": "The events are not matching the code you entered? Classrooms are missing or wrongly located on the map? A feature is not working the way you expected? <br><br> Maybe, you problem is due to a mistake in our code or in the encoding done by people maintening ADE's data. Whatever the source of you problem, please contact us and we will do all we can to fix it. "
      },
      {
        "id": "non-progs-typo",
        "icon": "bi bi-spellcheck",
        "title": "Typos correction",
        "content": "Writing thousands of lines in both English and French can be error prone, and it becomes hard to spot all the mistakes! <br><br> If you happen to spot one or several typos, please contact us so that we can correct them. This also applies if you think that a formulation is not correct or could be improved. "
      },
      {
        "id": "non-prog-request",
        "icon": "bi bi-plus-circle-fill",
        "title": "Request new features",
        "content": "ADE Scheduler is continuously evolving, with the goal to meet the requirements of UCLouvain's members in terms of scheduling tools. Therefore, any new feature request is welcome! Please reach us by describing the feature you want us to implement, additionally providing images if you have a clear idea in mind. "
      }
    ]
  },
  {
    "id": "prog",
    "title": "For programmers",
    "subtitles": [
      {
        "id": "progs-contribute",
        "icon": "bi bi-github",
        "title": "Contribute via GitHub",
        "content": " Our code is publicly available on  <a href='https://github.com/SnaKyEyeS/ADE-Scheduler'>GitHub</a> and we highly recommend programmers to use the git tool when working on projects. If your are new to this tool, never hesitate to ask us questions! <br><br> Everything that was said for non-programmers also applies for programmers. Instead of using emails, use GitHub <a href='https://github.com/SnaKyEyeS/ADE-Scheduler/issues'>issues</a> when you want to report a problem or ask for new feature, and <a href='https://github.com/SnaKyEyeS/ADE-Scheduler/pulls'>pull requests</a> when you want us to review your code and later include it in the tool. If you want to contribute but you do not have a specific idea in mind, it is good pratice to read the issues other people have written to see if you can help. <br><br> Even if you do not plan to contribute to the code, we highly recommend people who know git or GitHub to reach us via our GitHub repository as it allows us to centralize questions and keep a record of them. <br><br> Last but not least, we have written a complete documentation available <a href='https://ade-scheduler.readthedocs.io/en/latest/'>ici</a> to help you understand our code and contribute. "
      },
      {
        "id": "progs-ects",
        "icon": "bi bi-bookmark-check-fill",
        "title": "Earn ECTS at UCLouvain for contributing",
        "content": "To our knowledge, there are 2 courses at the EPL faculty which grant credits for contributing to an open source project. You can thus contribute to ADE Scheduler while also validating some ECTS for you studies!<br><br> The first one, <a href='https://uclouvain.be/en-cours-2021-linfo2401'>LINFO2401 \"Open Source strategy for software development\"</a>, is given during the first semester and asks for a very small contribution. We highly recommend this course as a good introduction to open source and it is worth 5 ECTS.<br><br> The second one, <a href='https://uclouvain.be/en-cours-2021-linfo2402'>LINFO2402 \"Open Source Project\"</a>, can be taken during either the first or the second semester and asks for a contribution worth 140h of work. This course can be accounted as an internship and it is worth 5 ECTS.<br><br> In the case you cannot, or do not want to, follow these courses, contributing to an open source project is definitely an added value to your CV. Even if it is a vey small contribution, such as typo correction, we will learn a lot from that! "
      }
    ]
  },
  {
    "id": "credits",
    "title": "Credits",
    "subtitles": [
      {
        "id": "credits-creators",
        "title": "Project creators",
        "content": "ADE Scheduler was originally created, during the summer of 2019, by three EPL students: Jérome Eertmans, Louis Navarre and Gilles Poncelet. At that time, they were completing their Bachelor's degree in Engineering. Since then, they have been the main maintainers of the project and still continue contributing to improve the tool day by day."
      },
      {
        "id": "credits-uclouvain",
        "title": "<img class='txt-img' src='/static/img/logo_UCL.png'></img>",
        "content": "Very rapidly, the project received support from some UCLouvain academical members. Thanks to them, the project has been granted an access to the official ADE API and is hosted on the UCLouvain's servers. We would like to give special thanks to: <ul class='mt-2'> <li>Pr. Yves Deville, for his long-time support through the years on many aspects: server hosting, API access, open source development, and more important his advices.</li><li>Mr. Francis Somers, for his help linking ADE Scheduler to the official ADE API</li><li>Mr. Anthony Gego, for his help maintaining our first server (until late 2020)</li><li>Mr. Rémi Rossi, for his help maintaining our new server (since late 2020)</li><li>And all the other UCLouvain academical members or students who shared this tool!</ul>"
      },
      {
        "id": "credits-contributors",
        "icon": "bi bi-star-fill",
        "title": "Contributors",
        "content": "As this project is open source, we would like to thank all the people that helped with this project. From signaling a bug to sharing the tool with friends, any help is important to us. If you ever want to help this project, never hesitate to reach us!"
      },
      {
        "id": "credits-open-week-2022",
        "title": "<small>Open Week 2022</small>",
        "content": "The Open Week is a yearly event at UCLouvain focused on open source projects and how to contribute to them. During Open Week 2022, one of the projects the participants could contribute to was ADE Scheduler. A group of three students worked on integrating external calendars (<a href=\"https://github.com/ADE-Scheduler/ADE-Scheduler/pull/850\">#850</a>): <ul class='mt-2'> <li>Corentin Libert (<a href=\"https://github.com/CorentinLibert\"><code class=\"notranslate\">CorentinLibert</code></a>),</li><li>Paul-Edouard Bertrand Van ouytsel (<a href=\"https://github.com/PaulEdouardBertrandVO\"><code class=\"notranslate\">PaulEdouardBertrandVO</code></a>),</li><li>Simon Cornelis (<a href=\"https://github.com/Simcornelis\"><code class=\"notranslate\">Simcornelis</code></a>).</ul>Many thanks to them!"
      }
    ]
  }
]
