Repository: ADE-Scheduler/ADE-Scheduler
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr

source: On this website, no account is required to use most of the tools. Your session is stored during 30 days so you can easily leave this webpage, come back later and see that everything stays unchanged. Nonetheless, if 30 days is not enough or if you want to watch and modify your schedule on more than one device, we suggest you to <a href="/account">create an account.</a> With this, you will also be able to save multiple schedules, rename them, choose their color palette and so on.
fr: Sur ADE Scheduler, il n'est pas requis d'avoir un compte pour utiliser la plupart des outils proposés. Votre session utilisateur est stockée via votre navigateur pour une durée de 30 jours. Il vous est donc possible d'automatiquement récupérer et modifier votre calendrier sur votre navigateur dans un délais de 30 jours après votre dernière connexion. Néanmoins, si vous désirez garder de manière persistante votre calendrier, ou si vous voulez pouvoir le consulter sur notre site depuis d'autres appareils, il est requis de vous <a href="/account">créer un compte.</a> Avec cela, vous pouvez créer et sauvegarder plusieurs calendriers, les renommer, choisir la palette de couleur, et bien d'autres choses encore.

source: Academical life is important but your private life is important too ! This is why you can also add custom events to your schedule. They will appear in your schedule but will also be taken into account when using the compute tools. This tool will try to minimize the conflicts with your custom events.
fr: La vie étudiante est importante, mais votre vie personnelle l'est encore plus !C'est pourquoi, il vous est possible d'ajouter vos propres évènements personnalisés à votre calendrier. Ils apparaitront dans le calendrier, mais ils seront aussi pris en compte lors du calcul du meilleur horaire de cours pour vous ! Notre outil de calcul tentera de minimiser les conflits entre les horaires de cours, et vos évènements personnels.

source: If you click on a course's code, on the left of the calendar page, you will see appearing all the events that are contained in this course, per type. You can select or unselect specific events in order to build you schedule the way you want.
fr: Si vous cliquez sur un code cours, sur la gauche de la page calendrier, vous verrez appraître tous les évènements contenus dans ce cours, par type. Vous pouvez (dé-)sélectionner des évènements spécifiques afin de construire l'horaire qui vous plaît.

source: Creating an account requires two things: an email address and a password. Your email address will only be used for password resetting and any important information we need to share with our users. On the account page, you can choose between your different schedules and also change their information. The academic year parameter will tell our service which year you want the information from (most of the time, only one possibility).
fr: Créer un compte requiert deux choses : une adresse email et un mot de passe. Votre adresse email sera uniquement utilisée pour changer votre mot de passe ou vous transmettre des informations importantes. Sur la page compte, vous pouvez choisir parmi vos différents horaires et aussi changer leurs informations. Le paramètre année académique indiquera à notre service l'année depuis laquelle vous souhaitez obtenir les évènements (la plupart du temps, seule une année est disponible).

source: The change log
fr: Les nouveautés

source: ADE Scheduler is always under developement as we try to propose the best tool for students and teachers at UCLouvain. It may then be possible that new features or changes have been made to the tool since your last use. To stay informed of all modifications of ADE Scheduler, do not hesitate to take a look at our <a href="/whatisnew">change log page</a>.
fr: Afin de fournir le meilleur outil possible aux étudiants et professeursde l'UCLouvain, ADE Scheduler est continuellement en développement. Il est donc possible que de nouvelles fonctionnalités soient ajoutées depuis votre dernière utilisation. Pour rester informé de toutes les modifications d'ADE Scheduler, n'hésitez pas à aller consulter notre page <a href="/whatisnew">des nouveautés</a>.

source: We are three students from UCLouvain. By the time we started this project, we were finishing our bachelor's degree in engineering (Electricity and Mechanics for Jérome and Gilles; Computer Science and Applied Mathematics for Louis).
fr: Nous sommes trois étudiants de l'UCLouvain. A l'époque où nous avions initié ce projet, nous finissions notre bachelier en ingénierie civile (électricité et mécanique pour Jérome et Gilles; sciences informatiques et mathématiques appliquées pour Louis).

source: Jérome is a student in the Ecole Polytechnique de Louvain, in engineering. He completed his bachelor degree in Electricity and Mechanics. He is now pursuing a master degree in Electromechanical Engineering.
fr: Jérome est un étudiant à l'Ecole Polytechnique de Louvain, en ingénieur civil. Il a un bachelier en électricité et mécanique. Actuellement, il suit un master en ingénieur civil mécatronique.

source: Louis is a student at the Ecole Polytechnique de Louvain, in engineering. He completed his bachelor degree in Applied Mathematics and Computing Science. He is now pursuing a master degree in Computer Sciences Engineering.
fr: Louis est un étudiant à l'Ecole Polytechnique de Louvain, en ingénieur civil. Il a un bachelier en sciences informatiques et mathématiques appliquées. Actuellement, il suit un master en ingénieur civil informatique.

source: Gilles is a student in the Ecole Polytechnique de Louvain, in engineering. He completed his bachelor degree in Electricity and Mechanics. He is now pursuing a master degree in Electromechanical Engineering.
fr: Gilles est un étudiant à l'Ecole Polytechnique de Louvain, en ingénieur civil. Il a un bachelier en électricité et mécanique. Actuellement, il suit un master en ingénieur civil mécatronique.

source: ADE Scheduler under new skin, welcome to the version 2.0 !
fr: ADE Scheduler fait peau neuve, bienvenue sur la version 2.0 !

source: The same as before. But in better. And in mobile version.
fr: Le même site qu'avant. Mais en mieux. Et disponible en version mobile.

source: Little information for old members from version 1.0: you now register using an email address. It means that your old accounts must be created again.
fr: Information pour les anciens utilisateurs : vous devez maintenant vous enregistrer avec une adresse email. Cela veut dire que vos anciens comptes ne fonctionneront plus.

source: Get started
fr: C'est parti !

source: January
fr: Janvier

source: "Contribute" page
fr: Page "Contribuer"

source: Towards a minimalist interface
fr: Vers une interface minimaliste

source: November
fr: Novembre

source: 2000 accounts created
fr: 2000 comptes créés

source: October
fr: Octobre

source: Custom events color
fr: Couleur des évènements personnels

source: Your changes can be automatically saved
fr: Vos changements peuvent être sauvegardés automatiquement

source: September
fr: Septembre

source: "What is new" page
fr: Page "Nouveautés"

source: Color palette accessible in the calendar
fr: Palette de couleurs accessibles dans le calendrier

source: All schedules accessible from the calendar
fr: Tous les horaires accessibles depuis le calendrier

source: August
fr: Août

source: Launch of ADE Scheduler 2.0!
fr: Lancement d'ADE Scheduler 2.0!

source: One of our goals with this project is to make it last. In an open source project, contribution from the community is very important as it helps us keeping the tool improving. To this end, we have created a new page where we document several ways you can help us with this project. Do not hesitate to have a look!
fr: L'un de nos objectifs avec ce projet est qu'il dure dans le temps. Dans un projet open source, la contribution de la part de la communauté joue un rôle important dans l'amélioration constante de l'outil. À cette fin, nous avons documenté plusieurs manières de nous venir en aide sur ce projet. N'hésitez surtout pas à aller jeter un coup d'oeil sur la page en question.

source: As we frequently add new features, we do not want to flood our users with too many information. We thus decided to operate three major changes: </br> <ul> <li>This page is not referenced is the header of the website anymore</li> <li>You can now hide or delete the results of the compute tool to gain readability</li> <li>To download you calendar, you now need to go into the export tab</li> </ul>
fr: Comme nous ajoutons régulièrement de nouvelles fonctionnalités, nous voulons éviter de noyer nos utilisateurs dans trop d'informations. Nous avons donc décidé d'opérer trois changements majeurs : </br> <ul> <li>Cette page n'est désormais plus référencée dans l'entête du site</li> <li>Vous pouvez maintenant cacher ou supprimer les résultats de l'outil de calcul d'horaire optimal</li> <li>Pour télécharger votre calendrier, cela se trouve maintenant dans l'onglet exporter</li> </ul>

source: More than 2000 people have created and confirmed their account on ADE Scheduler! This is 10 times more than what we did in one year with version 1. We are also recording more than 1000 different connections everyday. Thank you so much for using this tool!
fr: Plus de 2000 personnes ont créé et validé leur compte sur ADE Scheduler ! C'est plus de 10 fois ce qu'on avait atteint en un an avec la version 1. Nous enregistrons également plus de 1000 connections uniques par jour. On vous remercie énormément d'utiliser cet outil !

source: You can now modify the color of each individual custom event.
fr: Vous pouvez maintenant modifier la couleur de chacun de vos évènements personnels.

source: Sometimes, you make changes on your schedule, your forget to saved them, and, when you change device, your schedule is not up to date with your lastest changes. To avoid this problem, you can now toggle the automatic saving of your schedule on your account page.
fr: Parfois, vous faites des modifications sur votre horaire, vous oubliez de les sauvergarder, et, quand vous changez d'appareil, votre horaire n'est pas à jour avec vos derniers changements. Pour éviter ce problème, vous pouvez maintenant activer la sauvegarde automatique dans les paramètres de votre compte.

source: The "What is new" page shows all important modifications to ADE Scheduler. Do not hesitate to take a look from time to time to be aware of the new features !
fr: La nouvelle page "Nouveauté" répertorie toutes les modifications notables sur l'outil ADE Scheduler. N'hésitez pas à jeter un coup d'oeil de temps en temps pour voir les nouvelles fonctionnalités !

source: We must admit that modifying the events color in the "Account" menu is counter-intuitive... That is why you can now directly choose your own colors for your schedules directly in the "Calendar" menu. You can also do so without requiring an account. Moreover, we changed the initial color theme, in order to stress the difference between two different courses in the schedule.
fr: Nous devons admettre que modifier la couleur des évènements du calendrier depuis la page "Compte" n'était pas très intuitif... C'est pourquoi, il est désormais possible de choisir vos propres couleurs pour les cours/TPs/autres depuis la page "Calendrier"! Et ce, même sans devoir posséder un compte. De plus, nous avons aussi changé le thème couleur initial, afin d'accentuer la différence entre deux cours.

source: Please note that if you use a non traditional browser, it may happen that the color palette does not show up. We cannot do anything about it.
fr: Notez tout de même que si vous utilisez un navigateur particulier, il est possible que la palette permettant de modifier les couleurs à votre guise ne soit pas disponible... Cela est du au navigateur.

source: You can now consult and edit all your saved schedules without having to select them from the "Account" menu. If you have several saved schedules, you just have to click on the name of the currently selected schedule. You should see a list of the names of all of them; Selecting one of them will display it on the calendar.
fr: Vous pouvez désormais consulter et modifier tous vos différents horaires sauvegardés sans devoir passer par le menu "Compte". Si vous possédez plusieurs calendrier, il suffit pour cela de cliquer sur le nom de l'horaire affiché actuellement pour voir défiler le nom de tous vos horaires; il suffit ensuite de sélectionner celui de votre choix.

source: Launch of the new ADE Scheduler ! This version brings a new design, new features, and is more efficient. Moreover, it is mobile-friendly.
fr: Lancement de la nouvelle version d'ADE Scheduler ! Cette version, en plus d'un changement de design, de l'ajout de nouvelles fonctionnaliés, est plus efficace, et surtout adaptée aux mobiles.

source: Ooops... looks like the website is temporarily unusable.
fr: Ooops... on dirait que le site est temporairement inutilisable.

source: There are some running issues, but we are doing our best to fix them as soon as possible. We are sorry for the caused inconvenience.
fr: Il y a des soucis sur le serveur, mais nous faisons de notre mieux pour les régler aussi vite que possible. Nous sommes désolés pour la gêne ainsi causée.

source: In the meantime, you can still use the <a href="http://horaire.uclouvain.be/direct/" class="alert-link">official website</a>.
fr: En attendant, vous pouvez toujours utiliser le <a href="http://horaire.uclouvain.be/direct/" class="alert-link">site officiel</a>.

source: New password
fr: Nouveau mot de passe

source: Must be at least 8 characters long.
fr: Il doit y avoir au moins 8 caractères.

source: Confirm new password
fr: Confirmez le nouveau mot de passe

source: Password do not match
fr: Les mots de passes ne sont pas les mêmes

source: Enter your email address
fr: Entrez votre adresse mail

source: Invalid email address
fr: Adresse mail invalide

source: Email requires confirmation.
fr: Une confirmation de l'adresse email est requise.

source: Resend confirmation instructions
fr: Renvoyer les instructions de confirmation

source: Specify an email address and a password
fr: Specifiez une adresse mail et un mot de passe

source: Remember me
fr: Se souvenir de moi

source: Forgot password ?
fr: Mot de passe oublié ?

source: New to ADE Scheduler ?
fr: Nouveau chez ADE Scheduler ?

source: Sign up now !
fr: S'inscrire maintenant !

source: No password specified
fr: Aucun mot de passe spécifié

source: Confirm password
fr: Confirmez le mot de passe

source: If you did not receive a mail, please check your spam folder. Sometimes, our mails get lost there... :-(
fr: Si vous ne recevez pas de mail, vérifiez votre dossier de spam. Parfois, nos mails se perdent là-dedans... :-(

source: current_schedule
fr: horaire actuel

source: The schedule you requested does not exist in our database !
fr: L'horaire que vous avez demandé n'existe pas dans notre base de données !
