Repository: ADE-Scheduler/ADE-Scheduler
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr

source: An error has occurred
fr: Il y a eu une erreur

source: Resource not found
fr: Ressource non trouvée

source: 404 Page not found :(
fr: 404 Page non trouvée :(

source: Sunday
fr: Dimanche

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wednesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: New schedule
fr: Nouvel horaire

source: Warning
fr: Attention

source: You have unsaved changes in your current schedule. Continue ?
fr: Vous avez des changements qui n'ont pas été sauvegardés: voulez-vous quand même continuer ?

source: Cancel
fr: Annuler

source: Continue
fr: Continuer

source: A problem has occurred. Please contact us if it happens again.
fr: Oops, il y a eu un problème ! Veuillez nous contacter si ça se reproduit encore.

source: User settings
fr: Paramètres utilisateur

source: Automatically save your changes
fr: Sauvegarde automatique de vos modifications

source: Deactivate
fr: Désactiver

source: Activate
fr: Activer

source: Change your password
fr: Changer votre mot de passe

source: Color palette
fr: Palette de couleur

source: Academic year
fr: Année académique

source: Save
fr: Sauvegarder

source: View
fr: Afficher

source: Delete
fr: Supprimer

source: Schedules
fr: Horaires

source: You do not have any saved schedule at the moment
fr: Vous n'avez aucun horaire sauvegardé pour le moment

source: Open source software
fr: Logiciel libre

source: designed by Gilles Poncelet, Louis Navarre and Jérome Eertmans, students at the Ecole polytechnique de Louvain.
fr: créé par Gilles Poncelet, Louis Navarre et Jérome Eertmans, étudiants à l'École polytechnique de Louvain

source: You need to create an account to unlock this page
fr: Vous devez créer un compte pour débloquer cette page

source: Do not hesitate to create an account... you can:
fr: N'hésitez pas à créer un compte... avec, vous pouvez:

source: Save your schedules
fr: Sauvegarder vos horaires

source: Manage several schedules following your needs
fr: Gérer plusieurs horaires selon vos besoins

source: Modify the color of the events in the calendar
fr: Modifier la couleur des événements dans le calendrier

source: And so much more !
fr: Et bien plus !

source: Close
fr: Fermer

source: Create an account
fr: Créer un compte

source: Calendar
fr: Calendrier

source: Classrooms
fr: Locaux

source: Account
fr: Compte

source: Help
fr: Aide

source: Contact us
fr: Contact

source: Contribute
fr: Contribuer

source: Logout
fr: Déconnexion

source: Login
fr: Connexion

source: Register
fr: Inscription

source: Course program
fr: Programme de cours

source: Apply
fr: Appliquer

source: Location
fr: Localisation

source: No location
fr: Pas de lieu

source: No description
fr: Pas de description

source: Start
fr: Début

source: End
fr: Fin

source: Time
fr: Heure

source: to
fr: à

source: Days
fr: Jours

source: Color
fr: Couleur

source: Edit
fr: Modifier

source: Export
fr: Exporter

source: Subscription Link
fr: Lien d'abonnement

source: Schedule
fr: Horaire

source: Copy to clipboard
fr: Copier dans le presse-papier

source: You can use this link to export the schedule to your personnal calendar app (Google, iOS, etc.). This will ensure the data always stays up-to-date even through schedule changes from teachers.
fr: Vous pouvez utiliser ce lien pour exporter l'horaire vers votre application de calendrier (Google, iOS, etc.). Cela garantira que les données restent toujours à jour, même en cas de modification d'horaire par les professeurs.

source: Share Link
fr: Lien de partage

source: You can use this link to share your schedule with your friends.
fr: Vous pouvez utiliser ce lien pour partager votre horaire avec vos amis.

source: Download to iCalendar format
fr: Télécharger au format iCalendar

source: Download
fr: Télécharger

source: You can use this file and upload it to your favorite calendar app. Nonetheless, events will not be updated if any change occur on ADE.
fr: Vous pouvez utilisez ce fichier and l'importer dans votre application calendrier. Cependant, les évènements contenus dans ce dernier ne seront pas mis à jour si un changement a lieu sur ADE.

source: Add an event
fr: Ajouter un événement

source: Name
fr: Nom

source: Recurring event
fr: Événement récurrent

source: From
fr: De

source: To
fr: À

source: Days of week
fr: Jours de la semaine

source: Start of recurrence
fr: Début de récurrence

source: End of recurrence
fr: Fin de récurrence

source: Add
fr: Ajouter

source: The code you added does not exist in our database.
fr: Le code que vous avez entré n'existe pas dans notre base de données.

source: Show/Hide
fr: Étendre/Cacher

source: Delete best schedules
fr: Supprimer les horaires calculés

source: To view more info or adapt your schedule, click on a course code. To change the color palette, go to the account page.
fr: Afin de voir plus d'informations ou de modifier votre horaire, cliquez sur le code d'un cours. Pour changer la palette de couleur, allez sur la page compte.

source: Enter code
fr: Entrez un code

source: Search results
fr: Résultats

source: No results
fr: Aucun résultat

source: Colors
fr: Couleurs

source: Reset colors
fr: Réinitialiser les couleurs

source: Compute the best schedules with no conflict! See help page for more details on how it works
fr: Calculer les meilleurs horaires sans conflit ! Voir la page d'aide pour plus de détails sur comment ça marche

source: Compute
fr: Calculer

source: Start a new schedule from zero You can have multiple schedules with an account
fr: Démarre un nouvel horaire de zéro Vous pouvez cumuler plusieurs horaires avec un compte

source: New
fr: Nouveau

source: Schedule successfuly saved !
fr: Horaire sauvegardé avec succès !

source: Disclaimer: ADE Scheduler is not an official UCLouvain tool. It has been designed with the purpose to help the UCLouvain students with scheduling. This tool is based on ADE UCL but does not replace standard scheduling rules, nor the instructions given by university officials and teachers as those may vary from one course to another.
fr: Attention: ADE Scheduler n'est pas un outil officiel de l'UCLouvain. Il a été développé dans le but d'aider les étudiants de l'UCLouvain pour la composition de leur horaire. Cet outil est basé sur ADE UCL mais ne remplace ni les règles déjà existantes, les instructions données par l'université et les professeurs, car ces informations peuvent changer d'un cours à un autre.

source: Address
fr: Adresse

source: Search name
fr: Rechercher un nom

source: Search code
fr: Rechercher un code

source: Search address
fr: Rechercher une adresse

source: Do not hesitate to contact us in case of problem !
fr: N'hésitez pas à nous contacter en cas de problème !

source: Collaborative project
fr: Projet collaboratif

source: ADE Scheduler is open source
fr: ADE Scheduler est open source

source: You can help us!
fr: Vous pouvez nous aider !

source: For non-programmers
fr: Pour les non-programmeurs

source: Signal bugs
fr: Signaler des bugs

source: Typos correction
fr: Corriger de typos

source: Request new features
fr: Proposer de nouvelles fonctionnalités

source: For programmers
fr: Pour les programmeurs

source: Contribute via
fr: Contribuer via

source: Earn ECTS at UCLouvain for contributing
fr: Valider des crédits à l'UCLouvain en contribuant

source: One very important aspect of this project is that it is open source. In short, it means that everybody can access the whole code behind the tool and re-use it. But it also means that you can request changes so that the tool can be further improved. </br></br> Currently, ADE Scheduler is kindly supported by some academical members at UCLouvain so that we do not have to pay for server hosting fees and we are thankful for that!
fr: Un aspect très important de ce projet est qu'il est open source. Pour faire court, cela veut dire que tout le monde peut avoir un accès total au code et le ré-utiliser. Mais cela veut aussi dire que vous pouvez faire des demandes pour que l'outil soit amélioré. </br></br> Pour le moment, ADE Scheduler est supporté par quelques membres académiques de l'UCLouvain ce qui nous évite de devoir payer pour les frais liés au serveur et nous leur en sommes reconnaissants pour cela !

source: Even though this tool is functional, it is not perfect. New features, typos in text, missing translations or bugs? There are many things that you can help us improve. </br></br> Down below, we propose multiple ways for you to help us. Nonetheless, any other ideas are welcome!
fr: Même si l'outil est fonctionnel, il n'est pas parfait. Des nouvelles fonctionnalités, des typos dans du texte ou des bugs ? Il y a plein de choses que vous pouvez nous aider à améliorer. </br></br> Ci-dessous, nous proposons plusieurs façons de nous aider. Cependant, toute autre idée est la bienvenue !

source: For everything listed below, the best way to contact us is to do it via our email address. This can be found in the contact page. When reaching us, do not hesitate to include screenshots or even your calendar share link so that we can easily reproduce your problem (if applies) locally.
fr: Pour tout ce qui est listé plus bas, la meilleure manière pour nous contacter est de le faire via mail. Notre addresse se trouve sur la page de contact. Quand vous nous contactez, n'hésitez pas à inclure des captures d'écran ou même un lien de partage vers votre calendrier comme ça on peut aisément reproduire votre problème (si ça s'applique) localement.

source: The events are not matching the code you entered? Classrooms are missing or wrongly located on the map? A feature is not working the way you expected? </br></br> Maybe, you problem is due to a mistake in our code or in the encoding done by people maintening ADE's data. Whatever the source of you problem, please contact us and we will do all we can to fix it.
fr: Les évènements ne correspondent pas à ceux que vous avez encodés ? Des locaux sont manquant ou sont mal localisés sur la carte ? Une fonctionnalité ne marche pas comme vous le pensiez </br></br> Peut-être que le problème est du à une erreur dans notre code, ou peut-être est-ce dû à une faute dans l'encodage des cours de la part des personnes en charge des données de ADE. Quoi qu'il en soit, contactez-nous et nous ferons tout notre problème pour régler votre problème.

source: Writing thousands of lines in both English and French can be error prone, and it becomes hard to spot all the mistakes! </br></br> If you happen to spot one or several typos, please contact us so that we can correct them. This also applies if you think that a formulation is not correct or could be improved.
fr: Écrire des milliers de lignes de texte en anglais et en français devient rapidement sujet aux erreurs et cela devient difficile de toutes les trouver! </br></br> Si il vous arriver d'en trouver, contactez-nous comme ça on peut les corriger. Cela s'applique aussi si vous pensez qu'une formulation n'est pas correcte ou pourrait être améliorée.

source: ADE Scheduler is continuously evolving, with the goal to meet the requirements of UCLouvain's members in terms of scheduling tools. Therefore, any new feature request is welcome! Please reach us by describing the feature you want us to implement, additionally providing images if you have a clear idea in mind.
fr: ADE Scheduler évolue constamment, avec l'objectif de satisfaire les besoins des membres de l'UCLouvain en termes d'outils horaire. De ce fait, toute idée est la bienvenue ! N'hésitez pas à nous contacter en décrivant la nouvelle fonctionnalité que vous souhaiteriez voir, en ajoutant éventuellement des images si vous avez une idée claire en tête.

source: Our code is publicly available on <a href="https://github.com/SnaKyEyeS/ADE-Scheduler">GitHub</a> and we highly recommend programmers to use the git tool when working on projects. If your are new to this tool, never hesitate to ask us questions! </br></br> Everything that was said for non-programmers also applies for programmers. Instead of using emails, use GitHub <a href="https://github.com/SnaKyEyeS/ADE-Scheduler/issues">issues</a> when you want to report a problem or ask for new feature, and <a href="https://github.com/SnaKyEyeS/ADE-Scheduler/pulls">pull requests</a> when you want us to review your code and later include it in the tool. If you want to contribute but you do not have a specific idea in mind, it is good pratice to read the issues other people have written to see if you can help. </br></br> Even if you do not plan to contribute to the code, we highly recommend people who know git or GitHub to reach us via our GitHub repository as it allows us to centralize questions and keep a record of them. </br></br> Last but not least, we have written a complete documentation available <a href="https://ade-scheduler.readthedocs.io/en/latest/">here</a> to help you understand our code and contribute.
fr: Notre code est disponible pour tous sur <a href="https://github.com/SnaKyEyeS/ADE-Scheduler">GitHub</a> et nous recommandons fortement aux programmeurs d'utiliser l'outil git quand ils travaillent sur leurs projets. Si cet outil est nouveau pour vous, n'hésitez jamais à nous poser des questions ! </br></br> Tout ce qui a été dit pour les non-programmeurs s'applique aussi pour les programmeurs. À la place d'utiliser des mails, utilisez les <a href="https://github.com/SnaKyEyeS/ADE-Scheduler/issues">issues</a> GitHub quand vous voulez rapporter un problème ou faire une demande de nouvelle fonctionnalité, et les <a href="https://github.com/SnaKyEyeS/ADE-Scheduler/pulls">pull requests</a> quand vous voulez qu'on vérifie votre code pour éventuellement l'inclure dans l'outil. Si vous voulez contribuer mais que vous n'avez pas une idée spécifique en tête, c'est toujours une bonne idée d'aller lire les issues que d'autres personnes ont écrites afin de voir si vous pouvez aider. </br></br> Même si vous ne comptez pas contribuer au code, nous recommandons fortement aux personnes qui connaissent git ou GitHub de nous contacter via notre répertoire GitHub, cela nous permet de centraliser les questions et de garder un historique de ces dernières. </br></br> Dernière chose, mais pas des moindres, nous avons écrit une documentation complète disponible <a href="https://ade-scheduler.readthedocs.io/en/latest/">ici</a> pour vous aider à comprendre notre code afin d'y contribuer.

source: To our knowledge, there are 2 courses at the EPL faculty which grant credits for contributing to an open source project. You can thus contribute to ADE Scheduler while also validating some ECTS for you studies! </br></br> The first one, <a href="https://uclouvain.be/en-cours-2020-lingi2401">LINGI2401 "Open Source strategy for software development"</a>, is given during the first semester and asks for a very small contribution. We highly recommend this course as a good introduction to open source and it is worth 5 ECTS. </br></br> The second one, <a href="https://uclouvain.be/en-cours-2020-lingi2402">LINGI2402 "Open Source Project"</a>, can be taken during either the first or the second semester and asks for a contribution worth 140h of work. This course can be accounted as an internship and it is worth 5 ECTS. </br></br> In the case you cannot, or do not want to, follow these courses, contributing to an open source project is definitely an added value to your CV. Even if it is a vey small contribution, such as typo correction, we will learn a lot from that!
fr: À notre connaissance, il y a 2 cours à l'EPL qui offrent des crédits si vous contibruez à un projet open source. Vous pouvez donc contribuer à ADE Scheduler et, en même temps, valider des crédits pour vos études ! </br></br> Le premier, <a href="https://uclouvain.be/cours-2020-lingi2401">LINGI2401 "Open Source strategy for software development"</a>, est donné pendant le Q1 est demande de votre part de faire une contribution très petite. Nous le recommandons fortement comme étant une bonne introduction à l'open source et il vaut 5 crédits. </br></br> Le second, <a href="https://uclouvain.be/cours-2020-lingi2402">LINGI2402 "Open Source Project"</a>, peut être pris, au choix, au Q1 ou au Q2 et demande une contribution pour un total de 140h de travail. Ce dernier peut compter comme un stage et vaut 5 crédits. </br></br> Dans le cas où vous ne pouvez pas, ou ne voulez pas, suivre ces cours, contribuer à un projet open source reste une plus value très intéressante pour votre CV. Même si c'est une très petite contribution, comme une correction de typo, vous en apprendrez beaucoup !

source: Email address
fr: Adresse mail

source: Password
fr: Mot de passe

source: What is ADE Scheduler ?
fr: Qu'est-ce qu'ADE Scheduler ?

source: Getting started
fr: Pour débuter

source: Computing your optimal schedule
fr: Calculer votre horaire optimal

source: Export and load
fr: Importer et exporter

source: What are the possibilities ?
fr: Quelles sont les possibilités ?

source: Download an iCal file
fr: Télécharger un fichier iCal

source: Subscription links
fr: Liens d'abonnement

source: Account & Settings
fr: Compte & Paramètres

source: Custom events
fr: Evènements personnels

source: Event selection
fr: Sélection d'un évènement

source: Accounts
fr: Comptes

source: Stay informed
fr: Restez informés

source: The change log page
fr: La page des nouveautés

source: About us
fr: A propos de nous

source: Who are we ?
fr: Qui sommes-nous ?

source: ADE Scheduler is a tool aiming to provide the same information as the <a href="http://horaire.uclouvain.be/direct">UCLouvain's official schedule website</a> but with in a more intuitive way, while also offering many more tools such as subscription links, schedule organization, filtering unwanted events, classroom localization and so on.
fr: ADE Scheduler est un outil visant à fournir les mêmes informations que le <a href="http://horaire.uclouvain.be/direct">site officiel d'horaires de l'UCLouvain</a> mais de manière plus intuitive. Ce site offre en plus plusieurs outils comme des liens d'abonnement à des calendriers, l'organisation de vos différents horaires, le filtrage de certains évènements (par exemple CMs ou TPs), la visualisation des locaux et de leur emplacement, et bien d'autres choses encore !

source: The main purpose of this website is the calendar page. If you're new to this site, make sure to go to <a href="/calendar">this page</a> and try out some of the functionalities. You are also encouraged to watch our quick guide hereunder.
fr: L'objectif premier de ce site est son calendrier. Si vous êtes nouveaux ici, faites un tour sur <a href="/calendar">cette page</a> et testez toutes les fonctionnalités. Vous êtes aussi encouragés à regarder notre guide de prise en main rapide.

source: Sometimes, you may choose between multiple events such as CMs or TPs but only need to attend to one. The tool named compute tries all the possible combinations of picking one event of each type, every week, in order to find the 5 bests schedules which minimize the conflicts. If you want to be free during a given period, make sure to create a custom event to block this period of time. You can also remove some events before calling the compute function, to not take them into account. Because the compute function optimizes week per week, not all weeks must be the same. If you need to need to attend the same events every week, we encourage you to pick the week that suits your need from the results given by the compute tool and then manually select the events in your main schedule.
fr: Parfois, vous avez le choix parmi plusieurs évènements comme des CMs ou des TPs mais vous ne devez assister qu'à un seul de chaque. L'outil nommé calculer essaye toutes les combinaisons d'horaire possible en choisissant un évènement de chaque type, chaque semaine, et retourne les 5 meilleurs horaires qui minimisent les conflits. Si vous voulez être libre durant une tranche horaire, assurez-vous de créer un évent personnel durant cette tranche horaire. Vous pouvez également retirer des évènements avant d'utiliser l'outil de calcul, afin de ne pas les prendre en compte. Comme l'outil optimise semaine par semaine, il n'est pas certain que toutes les semaines soient les mêmes. Si vous avez besoin d'assister toujours aux mêmes évènements, nous vous encourageons à choisir, après calcul, la semaine qui vous plait le plus et de manuellement sélectionner les évènements dans votre horaire principal.

source: Once your schedule is complete, you don't need to go back to ADE-Scheduler each time you want to check your schedule: you can export it ! Most calendar apps, such as Gmail, support importing external calendar. A short video shows you how to export your calendar to your favorite app.
fr: Une fois votre horaire fait, vous n'avez pas besoin de retourner à chaque fois sur ADE Scheduler pour voir votre horaire : vous pouvez l'exporter ! La plupart des applications de calendriers, tel que Gmail, permettent d'importer un calendrier externe. Une courte vidéo vous montre comme exporter votre horaire vers votre application favorite.

source: One solution to export your schedule is to download it as an iCalendar file. Then, this file can easily be imported into your main calendar. The downside of this approach is that any further change in your schedule, from you or from ADE, won't be seen in your calendar. If you prefer to have calendar up-to-date, then choose the next option.
fr: Une solution pour exporter votre horaire est de le télécharger au format iCalendar. Ensuite, ce fichier peut être facilement importer dans votre calendrier principal. Le problème avec cette approche est qu'aucun changement dans votre horaire, de votre part ou de ADE, ne pourra être pris en compte dans votre calendrier. Si vous préférez avoir un calendrier à jour, choisissez alors la prochaine solution.

source: Maybe the best solution ADE Scheduler can offer is a subscription link. With this link, your calendar app will frequently download the latest events and you will never miss any change in your schedule ! Also, any manual change from your side, such as adding or removing a course, will be taken into account at the very next download of your schedule from you or from your app.
fr: La meilleure solution que peut vous proposer ADE Scheduler est certainement celle du lien d'abonnement. Avec ce lien, votre application de calendrier mettra à jour de manière régulière les évènements et vous ne manquerez aucun changement dans votre horaire ! Egalement, tout changement de votre part, tel qu'ajouter ou retirer un cours, sera pris en compte lors de la prochaine mise-à-jour de votre calendrier de la part de votre application.
