Repository: ADE-Scheduler/ADE-Scheduler
Catalog: webapp/app/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Calendar
fr: Calendrier

source: Help
fr: Aide

source: Contact us
fr: Nous contacter

source: Settings
fr: Paramètres

source: Save
fr: Sauver

source: Academic Year
fr: Année académique

source: Course priority
fr: Priorité des cours

source: Customize the priority given to a course, from no priority at all to maximum priority.
fr: Customisez la priorité accordée à un cours: d'aucune priorité jusqu'à priorité maximale.

source: Computation
fr: Calculs

source: WARNING: may cause long computation times, see help section.
fr: AVERTISSEMENT: peut causer de longs temps de calcul, voir la section Aide.

source: ADE schedule
fr: Horaire ADE

source: 1st schedule
fr: 1er horaire

source: 2nd schedule
fr: 2ème horaire

source: 3rd schedule
fr: 3ème horaire

source: Compare
fr: Comparer

source: ADE Schedule
fr: Horaire ADE

source: Compute
fr: Calculer

source: Refresh
fr: Rafraichir

source: Clear
fr: Réinitialiser

source: Forbidden Time Slot
fr: Bloquer un horaire

source: Start
fr: Début

source: End
fr: Fin

source: Cancel
fr: Annuler

source: Confirm
fr: Confirmer

source: Export Schedule
fr: Exporter l'horaire

source: Choose...
fr: Choisir...

source: Select your schedule.
fr: Sélectionner un horaire.

source: Copy link
fr: Copier le lien

source: ex: adescheduler.com/getcalendar?=subscription_link
fr: ex: adescheduler.com/getcalendar?=lien_d_abonnement

source: Generate link
fr: Générer

source: Generate a subscription link
fr: Générer un lien d'abonnement

source: Login
fr: Identifiant

source: Please specify a login
fr: Choisissez un identifiant

source: Password
fr: Mot de passe

source: Please choose a password
fr: Choisissez un mot de passe

source: Modifiable & protected link
fr: Lien modifiable @ protégé

source: Your schedules are not updated ! Please compute first.
fr: Les horaires ne sont pas à jour ! Calculez-les d'abord.

source: Please specify a schedule first.
fr: Spécifiez un horaire.

source: Close
fr: Fermer

source: Download file
fr: Télécharger le fichier

source: Get/Modify Schedule
fr: Récupérer/Modifier l'horaire

source: Login is required !
fr: identifiant requis !

source: Password is required !
fr: Mot de passe requis !

source: Don't change
fr: Ne pas changer

source: Update your schedule choice.
fr: Changer votre choix d'horaire.

source: Forgot link ?
fr: Lien oublié ?

source: Load session
fr: Charger

source: Save changes
fr: Sauvegarder

source: Your Link
fr: Votre URL

source: WARNING
fr: AVERTISSEMENT

source: Please select at least a schedule to compare !
fr: Sélectionnez au moins un horaire à comparer !

source: ERROR
fr: ERREUR

source: You specified a wrong time format ! Please try again.
fr: Le format utilisé est incorrect ! Essayez à nouveau.

source: Block Time Slots
fr: Bloquer un Horaire

source: Low
fr: Bas

source: Medium
fr: Moyen

source: High
fr: Haut

source: Current Courses
fr: Cours ajoutés

source: None
fr: Aucun

source: No event found !
fr: Aucun événement trouvé !

source: Add a course
fr: Ajouter un cours

source: Export
fr: Exporter

source: Log in
fr: Connexion

source: Disclaimer: this software is not an official UCLouvain tool. It has been designed with the purpose to help the EPL students with scheduling. This tool is based on ADE but does not replace standard scheduling rules, nor the instructions given by university officials and teachers as those may vary from one course to another.
fr: Disclamer: ce software n'est pas un outil officiel de l'UCLouvain. Il a été développé dans le but d'aider les étudiants de l'EPL pour la composition de leur horaire. Cet outil est basé sur ADE mais ne remplace ni les règles déjà existantes, les instructions données par l'université et les professeurs, car ces informations peuvent changer d'un cours à un autre.

source: A time slot where the user would like to be free
fr: Un moment ou l'utilisateur voudrait être libre

source: What is ADE Scheduler ?
fr: Qu'est-ce qu'ADE Scheduler

source: ADE Scheduler is a free tool designed by engineering students at the Ecole Polytechnique de Louvain. The purpose of the scheduler is to provide an easy-to-use tool to help students from the Université Catholique de Louvain get an overview of their schedule based on their choice of course. It provides a way to get ahead of any possible scheduling conflict and, if possible, resolve them by making the right choices. <br> However, it is not an official tool provided by the UCLouvain and the EPL. You should still consult from official sources as ADE Scheduler does not replace all the instructions professors and university officials may give to the students.
fr: ADE Scheduler est un outil gratuit, développé pour les étudiants ingénieur à l'Ecole Polytechnique de Louvain. Le but de l'application est de proposer un outil facile d'utilisation pour aider les étudiants de l'Université catholique de Louvain à avoir une vue d'ensemble de leur horaire, basé sur leurs choix de cours. Il offre un moyen de se prévenir de tout conflit horaire et, si possible, résoudre ceux-ci en prenant les bons choix. <br> Néanmoins, ceci n'est pas un outil officiel fourni par l'UCLouvain et l'EPL. Vous devez toujours consulter les sources officielles, puisqu'ADE Scheduler ne remplace pas les instructions des professeurs and de l'Université.

source: How to use ADE Scheduler ?
fr: Comment utiliser ADE Scheduler

source: It is truly easy: you simply need to specify the code (e.g. "LELEC1530", "LANGL1873", etc.) of the courses you are interested by. The possibilities related to your choice will then be displayed for you as you can find them on the UCLouvain's ADE website. <br> Next, simply press "Compute" and voilà ! the three best schedules will be shown. Once you have picked your schedule, you can easily export it to your own agenda by pressing the "Export" button.
fr: C'est réellement simple: vous devez spécifier le matricule (par exemple, "LELEC1530\“, "LANGL1873", ... (sans les guillemets)) des cours qui vous intéressent. Les possibilités en lien avec vos choix seront affichées pour vous, de la même manière que vous pourriez les trouver sur le site officel de l'UCLouvai, ADE. <br> Ensuite, il suffit de "Calculer" et voilà ! Les trois meilleurs horaires seront affichés. Une fois votre agenda choisi, vous pouvez facilement l'exporter dans votre propre agenda en cliquand sur "Exporter".

source: Export & Load
fr: Exporter & Télécharger

source: What are the possibilities ?
fr: Quelles sont les possibilités

source: ADE Scheduler offers three options to export your schedule to your own calendar:
fr: ADE Scheduler offre trois options pour exporter votre agenda vers votre propre application de calendrier préférée:

source: Download an iCal file
fr: Télécharger un fichier iCal

source: Non-modifiable subscription link
fr: Lien d'abbonnement non-modifiable

source: Modifiable subscription link
fr: Lien d'abonnement modifiable

source: You can export the schedule of your choice in the iCal (.ics) format and then add it to your own calendar (e.g: Google Calendars offers such an option). <br> To do so, simply press the "Export" button, choose the schedule you wish to export and press the "Download file" button. The download will start right away.
fr: Vous pouvez exporter l'agenda de votre choix dans le format iCal (.ics) et l'ajouter à votre propre application de calendrier (par exemple: Google Calendars offre ce type d'option). <br> Il suffit simplement de choisir "Exporter", de choisir l'agenda à exporter et ensuite de choisir "Télécharger le fichier". Le téléchargement se fera immédiatement.

source: Non-modifiable link
fr: Lien non-modifiable

source: Some calendars offer the possibility to suscribe to a pre-generated calendar. It means that you simply need to give a link to your calendar and it will regularly make a request to our website to automatically load the schedule you chose. This allows your calendar to stay updated, even if there is a last minute change in your schedule (new local, course cancelled, etc.). The calendar automatically requests for new updates every now and then, you do not have to worry about staying up-to-date ! <br> To do so, simply press the "Export" button, choose the schedule you wish to export and press the "Generate link" button. Then you simply need to copy/paste the link to your calendar's subscription system.
fr: Quelques applications de calendrier offrent la possibilité de s'abonner à un agenda pré-généré. Cela signifie qu'il suffit de donner un lien vers cet agenda, et l'application effectuera régulièrement une requête vers notre site pour récupérer automatiquement l'agenda de votre choix. Ceci permet, contrairement à un fichier statique (par exemple), de garder un agenda à jour, même s'il y a un changement de dernière minute (nouveau local, cours annulé ou déplacé, ...). Tout se fait donc automatiquement, sans besoin d'intervention de votre part

source: Modifiable link
fr: Lien modifiable

source: The modifiable link works in the exact same way as the non-modifiable link. However, you can protect your link with a username and a password. The advantage of doing so is that you will be able to come back at a later time and modify your scheduling wishes without having to start from scratch. You can also retrieve your link in case you lost it. <br> To create such a link, simply proceed as if it were a non-modifiable link, but toggle the "Modifiable & Protected link" button on and choose a username and password to proceed. Then, click "Generate link". <br> To retrieve your scheduling wishes, press the "Log in" button, specify your username & password then press "Load session". You can then modify your preferences/courses and save them through the same process, but by pressing "Save changes" instead. <br> Finally, press the "Forgot link ?" button to retrieve your subscription link.
fr: Le lien modifiable fonctionne exactement de la même manière que le lien non-modifiable. Cependant, vous pouvez protéger votre lien avec un compte personnel (identifiant, mot de passe). Agir de la sorte vous permet de revenir n'importe quand, pour modifier votre agenda sans repartir de zéro (vos données de cours sont sauvegardées personnellement). De plus, garder le même lien permet de ne pas devoir remettre à jour votre application de calendrier à jour en cas de changement d'agenda. Enfin, en cas de perte de votre lienvous pouvez le récupérer facilement grâce à votre compte. <br> Pour créer un lien modifiable, il suffit d'agir de la même manière que pour un lien non modifiable, mais sélectionner le "Lien modifiable et protégé", choisir un identifiant et mot de passe et confirmer. Ensuite, choisissez "Générer lien". <br> Pour récupérer votre calendrier déjà créé, choisissez "Connexion", spécifiez vos informations de compte, et cliquez "Charger la session". Vous pouvez ensuite modifier vos préférences/cours et sauvegarder ces changements de la même manière, en cliquant "Sauvegarder les changements". <br> Enfin, choisissez "Oublier lien" pour détruire votre lien d'abonnement.

source: Settings & Customization
fr: Paramètres & personnalisation

source: ADE Scheduler offers various customization possibilites, so that you can compose a schedule that best fits your own needs and wishes. Here is a list of those possibilites, which we will dive into more in details in the following sections:
fr: ADE Scheduler offre plusieurs possibilités de personnalisation, vous offrant la possibilité de construire l'agenda qui correspond le mieux à vos attentes et vos besoins. Voici une liste de possibilités, que nous développons dans les sections suivantes:

source: Forbidden Time Slots
fr: Slots horaires protégés (FTS)

source: Course IDs selection
fr: Sélection des IDs de cours

source: All the students have a life beside the university and this life sometimes brings its own scheduling constrains. Our Forbidden Time Slots ("FTS") system provides a way for the user to specify when he would like to be free. There are three level of priority you can pick from: low, medium and high. The higher the priority, the harder the scheduling algorithm tries to free a time slot from any university events. <br> However, it does not guaranty that it will be able to find a way around your specifications and wishes. To add a FTS, you simply need to pick one and drag it onto the calendar, at the day you wish to be free. You will then have to specify a start and end time. <br> Once your FTS is created, you can move it around by dragging it and you can even duplicate it (in case your indisponibility would be a recurring event) by pressing the ALT key and dragging it. If you made a mistake, you can easily delete a FTS by clicking on it with the SHIFT key pressed.
fr: Chaque étudiant a une vie à côté de l'université, et cela amène parfois des contraintes à certains horaires. Notre system de <i>Forbidden Time Slots</i> ("FTS") offre un moyen à l'utilisateur de spécifier les blocs horaires où il souhaite être disponible. Il y a trois niveaux de priorité: bas, moyen et haut. Plus la priorité est élevée, plus l'algorithme tentera de garder cette emplacement horaire disponible pour l'utilisateur. Cependant, cet outil ne garantit pas qu'il sera possible de rester les souhaits et spécifications de l'utilisateur. Pour ajouter un FTS, vous devez simplement en sélectionner un, et le déplacer dans le calendrier, le jour où vous souhaitez être disponible. Vous devez ensuite choisir l'heure de début ainsi que l'heure de fin de ce bloc horaire réservé. Une fois créé, vous pouvez toujours le déplacer en le sélectionnant; et même le dupliquer (en cas d'événement récurent) en appuyant sur ALT et sélectionnant le bloc. En cas d'erreur, vous pouvez simplement supprimer le bloc en appuyant sur SHIFT tout en sélectionnant le bloc.

source: You can select/deselect certain courses so they will not appear on the calendar. This is a great tool to comply with university instructions regarding imposed CM or TP.
fr: Vous pouvez sélectionner/désélectionner certains cours afin qu'il n'apparaissent pas dans l'agenda. Cet outil est très utile pour, par exemple, se conformer avec les séances de TP/CM déjà assignées par l'université.

source: You can customize the priority of each course you have selected. This priority is used, for example, in case of conflict. To adjust the priority of a course, move the corresponding cursor in the Settings menu.
fr: Vous pouvez personnaliser la priorité de chaque cours sélectionné. Cette priorité est utilisée, par exemple, en cas de conflit horaire entre deux cours. Pour modifier la priorité d'un cours, déplacez le curseur correspondant dans le menu Paramètres.

source: If you want to check your schedule for the next year, you can change the Academic Year from the Settings menu. The scheduler will automatically fetch the courses for the specified year.
fr: Si vous voulez regarder votre horaire pour l'année prochaine, vous pouvez changer l'Année Académique dans le menu Paramètres. Le calendrier récupérera automatiquement les cours pour l'année correspondante.

source: Computing a all the possible schedules is a very hard and complex problem, known to be NP-Complete. As a result, some course combinations can lead to huge computation times. <br> The <i>safe compute</i> option acts as a safeguard by removing some obviously conflicted schedules before the computation starts. This guarantees short computation times. <br> However, you can manually override this option and request for a complete computation. Be warned: the resulting lags can be very important.
fr: Calculer toutes les possibilités d'agencement de cours est un problème très complexe connu pour être NP-Complet. Par conséquent, certaines combinaisons de cours peuvent amener un temps de calcul relativement long. L'option <i>safe compute</i> agit comme une protection, en retirant avant calcul quelques conflits horaires assez basiques. Cela garantit un temps de calcul court. Cependant, vous pouvez manuellement désactiver cette option, pour exiger un calcul de calendrier tout à fait complet. Attention: les performances peuvent être fortement atteintes.

source: About us
fr: A propos de nous

source: Who are we ?
fr: Qui sommes-nous ?

source: We are three students from UCLouvain. By the time we started this project, we were finishing our bachelor's degree in engineering (electricity and mechanics for Jerome and Gilles; informatics and applied mathematics for Louis).
fr: Nous sommes trois étudiants de l'UCLouvain. Lorsque nous avons commencé ce projet, nous finissions notre bachelier en ingénieur civil (électricité et mécanique pour Jérome et Gilles; informatique et mathématiques appliquées pour Louis).

source: Why did we make this project ?
fr: Pourquoi avons-nous fait ce projet ?

source: Making your own schedule is something that students have been doing for a long time. And sometimes, specially at the EPL, we are drown in all the possibilites to make your own schedule. <br> Options, time conflicts, own comfort: everyone has his own preferences, and sometimes it is not easy to make your own schedule. <br> Our tool is here to help you during this reflexion time, and gives you a lot of flexibility to compute your own schedule ! Go in the above sections to see all the potential of it!
fr: Organiser son propre agenda est quelque chose que les étudiants font depuis bien longtemps. Et parfois, spécialement à l'EPL, nous sommes plongés dans toutes les possibilités pour créer son propre horaire. <br> Options, conflits horaires, son propre confort: tout le monde a ses propres préférences, et parfois il n'est pas facile de créer son propre horaire. <br> Notre outil est ici pour vous aider durant votre réflexion, et vous offre beaucouup de flexibilité pour créer votre agenda !Naviguez parmis les sections ci-dessus pour découvrir tout son potentiel !

source: Jérome is a student in the Ecole Polytechnique de Louvain, in civil engineering. He completed his bachelor degree in Electricity and Mechanics. He is now pursuing a master deree in Mechatronics. <br> Mail: jerome.eertmans@student.uclouvain.be
fr: Jérome est un étudiant de l'Ecole Polytechnique de Louvain, en ingénieur civil. Il a fini son bachelier en électricité et mécanique. Il est désormais en cours de master en mécatronique. <br> email: jerome.eertmans@student.uclouvain.be

source: Gilles is a student in the Ecole Polytechnique de Louvain, in civil engineering. He completed his bachelor degree in Electricity and Mechanics. He is now pursuing a master deree in Mechatronics. <br> Mail: gilles.poncelet@student.uclouvain.be
fr: Gilles est un étudiant de l'Ecole Polytechnique de Louvain, en ingénieur civil. Il a fini son bachelier en électricité et mécanique. Il est désormais en cours de master en mécatronique. <br> email: gilles.poncelet@student.uclouvain.be

source: Louis is a student at the Ecole Polytechnique de Louvain, in civil engineering. He completed his bachelor degree in Applied Mathematics and Computing Science. He is now pusruing a master degree in Computing Sciences. <br> Mail: navarre.louis@student.uclouvain.be
fr: Louis est un étudiant de l'Ecole Polytechnique de Louvain, en ingénieur civil. Il a fini son bachelier en informatique et mathématiques appliquées. Il est désormais en cours de master en intelligence artificielle email: navarre.louis@student.uclouvain.be
