[
  {
    "id": "ade-scheduler",
    "title": "ADE Scheduler",
    "subtitles": [
      {
        "id": "what-is",
        "title": "What is ADE Scheduler ?",
        "content": "ADE Scheduler is a tool aiming to provide the same information as the <a href='http://horaire.uclouvain.be/direct/'>UCLouvain's official schedule website</a> but with in a more intuitive way, while also offering many more tools such as subscription links, schedule organization, filtering unwanted events, classroom localization and so on. "
      },
      {
        "id": "getting-started",
        "title": "Getting started",
        "content": "The main purpose of this website is the calendar page. If you're new to this site, make sure to go to <a href='https://ade-scheduler.info.ucl.ac.be/calendar'>this page</a> and try out some of the functionalities. You are also encouraged to watch our quick guide hereunder.",
        "video": "https://www.youtube.com/embed/u82x-eysurU"
      },
      {
        "id": "computing",
        "title": "Computing your optimal schedule",
        "content": " Sometimes, you may choose between multiple events such as CMs or TPs but only need to attend to one. The tool named compute tries all the possible combinations of picking one event of each type, every week, in order to find the 5 bests schedules which minimize the conflicts. If you want to be free during a given period, make sure to create a custom event to block this period of time. You can also remove some events before calling the compute function, to not take them into account. Because the compute function optimizes week per week, not all weeks must be the same. If you need to need to attend the same events every week, we encourage you to pick the week that suits your need from the results given by the compute tool and then manually select the events in your main schedule. ",
        "video": "https://www.youtube.com/embed/l87bsDuCJmg"
      }
    ]
  },
  {
    "id": "export",
    "title": "Export and load",
    "subtitles": [
      {
        "id": "possibilities",
        "title": "What are the possibilities ?",
        "content": "Once your schedule is complete, you don't need to go back to ADE-Scheduler each time you want to check your schedule: you can export it ! Most calendar apps, such as Gmail, support importing external calendar. A short video shows you how to export your calendar to your favorite app. ",
        "video": "https://www.youtube.com/embed/4IiNB3J1Dm0"
      },
      {
        "id": "ical-file",
        "title": "Download an iCal file",
        "content": "One solution to export your schedule is to download it as an iCalendar file. Then, this file can easily be imported into your main calendar. The downside of this approach is that any further change in your schedule, from you or from ADE, won't be seen in your calendar. If you prefer to have calendar up-to-date, then choose the next option. "
      },
      {
        "id": "sub-link",
        "title": "Subscription links",
        "content": "Maybe the best solution ADE Scheduler can offer is a subscription link. With this link, your calendar app will frequently download the latest events and you will never miss any change in your schedule ! Also, any manual change from your side, such as adding or removing a course, will be taken into account at the very next download of your schedule from you or from your app."
      }
    ]
  },
  {
    "id": "account",
    "title": "Account & Settings",
    "subtitles": [
      {
        "id": "possibilities-2",
        "title": "What are the possibilities ?",
        "content": "On this website, no account is required to use most of the tools. Your session is stored during 30 days so you can easily leave this webpage, come back later and see that everything stays unchanged. Nonetheless, if 30 days is not enough or if you want to watch and modify your schedule on more than one device, we suggest you to <a href='https://ade-scheduler.info.ucl.ac.be/account'>create an account</a>. With this, you will also be able to save multiple schedules, rename them, choose their color palette and so on. "
      },
      {
        "id": "custom-events",
        "title": "Custom events",
        "content": "Academical life is important but your private life is important too ! This is why you can also add custom events to your schedule. They will appear in your schedule but will also be taken into account when using the compute tools. This tool will try to minimize the conflicts with your custom events. "
      },
      {
        "id": "event-selection",
        "title": "Event selection",
        "content": "If you click on a course's code, on the left of the calendar page, you will see appearing all the events that are contained in this course, per type. You can select or unselect specific events in order to build you schedule the way you want. "
      },
      {
        "id": "accounts",
        "title": "Accounts",
        "content": "Creating an account requires two things: an email address and a password. Your email address will only be used for password resetting and any important information we need to share with our users. On the account page, you can choose between your different schedules and also change their information. The academic year parameter will tell our service which year you want the information from (most of the time, only one possibility). "
      },
      {
        "id": "external-calendars",
        "title": "External calendars",
        "content": "Maybe you have an external calendar that you wish to share with others? Use cases can be student events like CASA's events, 24h Vélo, etc. Doing so is possible by going to the account page and creating your own external calendar. For that, you must provide a iCal link to your calendar. Those links can be easily generated, e.g., with Google Calandar agendas. To avoid spamming, your calendar must be first approved by us, which is why we recommend using the description field to communicate the goal of your calendar, as well as sending us an email."
      }
    ]
  },
  {
    "id": "stay-informed",
    "title": "Stay informed",
    "subtitles": [
      {
        "id": "changelog",
        "title": "Changelog",
        "content": "ADE Scheduler is always under developement as we try to propose the best tool for students and teachers at UCLouvain. It may then be possible that new features or changes have been made to the tool since your last use. To stay informed of all modifications of ADE Scheduler, do not hesitate to take a look at our <a href='https://ade-scheduler.info.ucl.ac.be/whatisnew'>changelog page</a>. "
      }
    ]
  }
]
