[
  {
    "id": "september-2021",
    "title": "September 2021",
    "subtitles": [
      {
        "id": "minor-improvements",
        "title": "New features",
        "content": "In addition to a lot of work on ADE Scheduler's CI, you can now enjoy some new features, some of which were directly inspired from you personal requests: <ul class='mt-2'><li>It is now possible to (un-)select all the event from a course with only one mouse click</li><li>For every course, you can access its UCLouvain webpage with the description of the course via the small `globe` icon</li><li>Events now contain more details if present (e.g.: information about TP)</li></ul>"
      }
    ]
  },
  {
    "id": "january",
    "title": "January 2021",
    "subtitles": [
      {
        "id": "page-contribute",
        "title": "\"Contribute\" page",
        "content": "One of our goals with this project is to make it last. In an open source project, contribution from the community is very important as it helps us keeping the tool improving. To this end, we have created a new page where we document several ways you can help us with this project. Do not hesitate to have a look! "
      },
      {
        "id": "minimalism",
        "title": "Towards a minimalist interface",
        "content": "As we frequently add new features, we do not want to flood our users with too many information. We thus decided to operate three major changes:<ul class='mt-2'><li>This page is not referenced is the header of the website anymore</li><li>You can now hide or delete the results of the compute tool to gain readability</li><li>To download you calendar, you now need to go into the export tab</li></ul>"
      }
    ]
  },
  {
    "id": "november",
    "title": "November 2020",
    "subtitles": [
      {
        "id": "milestone",
        "title": "200 accounts created",
        "content": "More than 2000 people have created and confirmed their account on ADE Scheduler! This is 10 times more than what we did in one year with version 1. We are also recording more than 1000 different connections everyday. Thank you so much for using this tool! "
      }
    ]
  },
  {
    "id": "october",
    "title": "October 2020",
    "subtitles": [
      {
        "id": "custom-events",
        "title": "Custom events color",
        "content": "You can now modify the color of each individual custom event. "
      },
      {
        "id": "autosave",
        "title": "Your changes can be automatically saved",
        "content": "Sometimes, you make changes on your schedule, your forget to saved them, and, when you change device, your schedule is not up to date with your lastest changes. To avoid this problem, you can now toggle the automatic saving of your schedule on your account page. "
      }
    ]
  },
  {
    "id": "september",
    "title": "September 2020",
    "subtitles": [
      {
        "id": "page-whatisnew",
        "title": "\"What is new\" page",
        "content": "The \"What is new\" page shows all important modifications to ADE Scheduler. Do not hesitate to take a look from time to time to be aware of the new features ! "
      },
      {
        "id": "color-palette",
        "title": "Color palette accessible in the calendar",
        "content": "We must admit that modifying the events color in the \"Account\" menu is counter-intuitive... That is why you can now directly choose your own colors for your schedules directly in the \"Calendar\" menu. You can also do so without requiring an account. Moreover, we changed the initial color theme, in order to stress the difference between two different courses in the schedule. <br> Please note that if you use a non traditional browser, it may happen that the color palette does not show up. We cannot do anything about it. "
      },
      {
        "id": "calendar-access",
        "title": "All schedules accessible from the calendar",
        "content": "You can now consult and edit all your saved schedules without having to select them from the \"Account\" menu. If you have several saved schedules, you just have to click on the name of the currently selected schedule. You should see a list of the names of all of them; Selecting one of them will display it on the calendar. "
      }
    ]
  },
  {
    "id": "august",
    "title": "August 2020",
    "subtitles": [
      {
        "id": "launch",
        "title": "Launch of ADE Scheduler 2.0",
        "content": "Launch of the new ADE Scheduler ! This version brings a new design, new features, and is more efficient. Moreover, it is mobile-friendly. "
      }
    ]
  }
]
