[
  {
    "id": "september-2021",
    "title": "Septembre 2021",
    "subtitles": [
      {
        "id": "minor-improvements",
        "title": "Nouvelles fonctionnalités",
        "content": "En plus d'un gros travail de CI réalisé sur ADE Scheduler, vous pouvez maintenant découvrir quelques nouvelles fonctionnalités, dont certaines sont directement issues de vos demandes personnelles : <ul class='mt-2'><li>Il est maintenant possible de (dé)sélectionner tous les évènements d'un cours en un seul clic</li><li>Pour chaque cours, vous pouvez accéder à sa page descriptive sur le site UCLouvain via la petite icône `globe`</li><li>Les évènements contiennent maintenant plus de détails si présents (ex.: type de TP)</li></ul>"
      }
    ]
  },
  {
    "id": "january",
    "title": "Janvier 2021",
    "subtitles": [
      {
        "id": "page-contribute",
        "title": "Page \"Contribuer\"",
        "content": " L'un de nos objectifs avec ce projet est qu'il dure dans le temps. Dans un projet open source, la contribution de la part de la communauté joue un rôle important dans l'amélioration constante de l'outil. À cette fin, nous avons documenté plusieurs manières de nous venir en aide sur ce projet. N'hésitez surtout pas à aller jeter un coup d'oeil sur la page en question."
      },
      {
        "id": "minimalism",
        "title": "Vers une interface minimaliste",
        "content": "Comme nous ajoutons régulièrement de nouvelles fonctionnalités, nous voulons éviter de noyer nos utilisateurs dans trop d'informations. Nous avons donc décidé d'opérer trois changements majeurs : <ul class='mt-2'><li>Cette page n'est désormais plus référencée dans l'entête du site</li><li>Vous pouvez maintenant cacher ou supprimer les résultats de l'outil de calcul d'horaire optimal</li><li>Pour télécharger votre calendrier, cela se trouve maintenant dans l'onglet exporter</li></ul>"
      }
    ]
  },
  {
    "id": "november",
    "title": "Novembre 2020",
    "subtitles": [
      {
        "id": "milestone",
        "title": "2000 comptes créés",
        "content": " Plus de 2000 personnes ont créé et validé leur compte sur ADE Scheduler ! C'est plus de 10 fois ce qu'on avait atteint en un an avec la version 1. Nous enregistrons également plus de 1000 connexions uniques par jour. On vous remercie énormément d'utiliser cet outil ! "
      }
    ]
  },
  {
    "id": "october",
    "title": "Octobre 2020",
    "subtitles": [
      {
        "id": "custom-events",
        "title": "Couleur des évènements personnels",
        "content": "Vous pouvez maintenant modifier la couleur de chacun de vos évènements personnels. "
      },
      {
        "id": "autosave",
        "title": "Vos changements peuvent être sauvegardés automatiquement",
        "content": " Parfois, vous faites des modifications sur votre horaire, vous oubliez de les sauvegarder, et, quand vous changez d'appareil, votre horaire n'est pas à jour avec vos derniers changements. Pour éviter ce problème, vous pouvez maintenant activer la sauvegarde automatique dans les paramètres de votre compte. "
      }
    ]
  },
  {
    "id": "september",
    "title": "Septembre 2020",
    "subtitles": [
      {
        "id": "page-whatisnew",
        "title": "Page \"Nouveautés\"",
        "content": "La nouvelle page \"Nouveautés\" répertorie toutes les modifications notables sur l'outil ADE Scheduler. N'hésitez pas à jeter un coup d'oeil de temps en temps pour voir les nouvelles fonctionnalités ! "
      },
      {
        "id": "color-palette",
        "title": "Palette de couleurs accessibles dans le calendrier",
        "content": "Nous devons admettre que modifier la couleur des évènements du calendrier depuis la page \"Compte\" n'était pas très intuitif... C'est pourquoi, il est désormais possible de choisir vos propres couleurs pour les cours/TPs/autres depuis la page \"Calendrier\"! Et ce, même sans devoir posséder un compte. De plus, nous avons aussi changé le thème initial de couleur, afin d'accentuer la différence entre deux cours.  <br> Notez tout de même que si vous utilisez un navigateur particulier, il est possible que la palette permettant de modifier les couleurs à votre guise ne soit pas disponible... Cela est dû au navigateur. "
      },
      {
        "id": "calendar-access",
        "title": "Tous les horaires accessibles depuis le calendrier",
        "content": "Vous pouvez désormais consulter et modifier tous vos différents horaires sauvegardés sans devoir passer par le menu \"Compte\". Si vous possédez plusieurs calendriers, il suffit pour cela de cliquer sur le nom de l'horaire affiché actuellement pour voir défiler le nom de tous vos horaires; il suffit ensuite de sélectionner celui de votre choix. "
      }
    ]
  },
  {
    "id": "august",
    "title": "Août 2020",
    "subtitles": [
      {
        "id": "launch",
        "title": "Lancement d'ADE Scheduler 2.0",
        "content": "Lancement de la nouvelle version d'ADE Scheduler ! Cette version, en plus d'un changement de design, de l'ajout de nouvelles fonctionnalités, est plus efficace, et surtout adaptée aux mobiles. "
      }
    ]
  }
]
